package additionalInformation.GitHub;

public class GitBranches {
    // команда git branch отображает все активные ветки. Звездочкой обозначается текущая ветка
    // git branch --v показывает также последний коммит который был сделан в ветке

    // Создание новой ветки git branch "name branch". При создании ветки ее состояние будет таким же, как у ветки от
    // которой делается отвлетвение
    // переключение в другую ветку git checkout "name branch". При этом если например комитить в ветку develop то все изменения
    // сохранятся только для нее. Если мы переключимся обратно на ветку master то все изменения закоммиченные для ветки
    // develop пропадут
}
